{
    "architectures": [
        "Llama4ForConditionalGeneration"
    ],
    "boi_token_index": 200080,
    "eoi_token_index": 200081,
    "image_token_index": 200092,
    "model_type": "llama4",
    "quantization_config": {
        "config_groups": {
            "group_0": {
                "input_activations": {
                    "actorder": null,
                    "block_structure": null,
                    "dynamic": true,
                    "group_size": null,
                    "num_bits": 8,
                    "observer": null,
                    "observer_kwargs": {},
                    "strategy": "token",
                    "symmetric": true,
                    "type": "float"
                },
                "output_activations": null,
                "targets": [
                    "Linear"
                ],
                "weights": {
                    "actorder": null,
                    "block_structure": null,
                    "dynamic": false,
                    "group_size": null,
                    "num_bits": 8,
                    "observer": "minmax",
                    "observer_kwargs": {},
                    "strategy": "channel",
                    "symmetric": true,
                    "type": "float"
                }
            }
        },
        "format": "float-quantized",
        "global_compression_ratio": null,
        "ignore": [
            "vision_model.patch_embedding.linear",
            "vision_model.model.layers.0.self_attn.q_proj",
            "vision_model.model.layers.0.self_attn.k_proj",
            "vision_model.model.layers.0.self_attn.v_proj",
            "vision_model.model.layers.0.self_attn.o_proj",
            "vision_model.model.layers.0.mlp.fc1",
            "vision_model.model.layers.0.mlp.fc2",
            "vision_model.model.layers.1.self_attn.q_proj",
            "vision_model.model.layers.1.self_attn.k_proj",
            "vision_model.model.layers.1.self_attn.v_proj",
            "vision_model.model.layers.1.self_attn.o_proj",
            "vision_model.model.layers.1.mlp.fc1",
            "vision_model.model.layers.1.mlp.fc2",
            "vision_model.model.layers.2.self_attn.q_proj",
            "vision_model.model.layers.2.self_attn.k_proj",
            "vision_model.model.layers.2.self_attn.v_proj",
            "vision_model.model.layers.2.self_attn.o_proj",
            "vision_model.model.layers.2.mlp.fc1",
            "vision_model.model.layers.2.mlp.fc2",
            "vision_model.model.layers.3.self_attn.q_proj",
            "vision_model.model.layers.3.self_attn.k_proj",
            "vision_model.model.layers.3.self_attn.v_proj",
            "vision_model.model.layers.3.self_attn.o_proj",
            "vision_model.model.layers.3.mlp.fc1",
            "vision_model.model.layers.3.mlp.fc2",
            "vision_model.model.layers.4.self_attn.q_proj",
            "vision_model.model.layers.4.self_attn.k_proj",
            "vision_model.model.layers.4.self_attn.v_proj",
            "vision_model.model.layers.4.self_attn.o_proj",
            "vision_model.model.layers.4.mlp.fc1",
            "vision_model.model.layers.4.mlp.fc2",
            "vision_model.model.layers.5.self_attn.q_proj",
            "vision_model.model.layers.5.self_attn.k_proj",
            "vision_model.model.layers.5.self_attn.v_proj",
            "vision_model.model.layers.5.self_attn.o_proj",
            "vision_model.model.layers.5.mlp.fc1",
            "vision_model.model.layers.5.mlp.fc2",
            "vision_model.model.layers.6.self_attn.q_proj",
            "vision_model.model.layers.6.self_attn.k_proj",
            "vision_model.model.layers.6.self_attn.v_proj",
            "vision_model.model.layers.6.self_attn.o_proj",
            "vision_model.model.layers.6.mlp.fc1",
            "vision_model.model.layers.6.mlp.fc2",
            "vision_model.model.layers.7.self_attn.q_proj",
            "vision_model.model.layers.7.self_attn.k_proj",
            "vision_model.model.layers.7.self_attn.v_proj",
            "vision_model.model.layers.7.self_attn.o_proj",
            "vision_model.model.layers.7.mlp.fc1",
            "vision_model.model.layers.7.mlp.fc2",
            "vision_model.model.layers.8.self_attn.q_proj",
            "vision_model.model.layers.8.self_attn.k_proj",
            "vision_model.model.layers.8.self_attn.v_proj",
            "vision_model.model.layers.8.self_attn.o_proj",
            "vision_model.model.layers.8.mlp.fc1",
            "vision_model.model.layers.8.mlp.fc2",
            "vision_model.model.layers.9.self_attn.q_proj",
            "vision_model.model.layers.9.self_attn.k_proj",
            "vision_model.model.layers.9.self_attn.v_proj",
            "vision_model.model.layers.9.self_attn.o_proj",
            "vision_model.model.layers.9.mlp.fc1",
            "vision_model.model.layers.9.mlp.fc2",
            "vision_model.model.layers.10.self_attn.q_proj",
            "vision_model.model.layers.10.self_attn.k_proj",
            "vision_model.model.layers.10.self_attn.v_proj",
            "vision_model.model.layers.10.self_attn.o_proj",
            "vision_model.model.layers.10.mlp.fc1",
            "vision_model.model.layers.10.mlp.fc2",
            "vision_model.model.layers.11.self_attn.q_proj",
            "vision_model.model.layers.11.self_attn.k_proj",
            "vision_model.model.layers.11.self_attn.v_proj",
            "vision_model.model.layers.11.self_attn.o_proj",
            "vision_model.model.layers.11.mlp.fc1",
            "vision_model.model.layers.11.mlp.fc2",
            "vision_model.model.layers.12.self_attn.q_proj",
            "vision_model.model.layers.12.self_attn.k_proj",
            "vision_model.model.layers.12.self_attn.v_proj",
            "vision_model.model.layers.12.self_attn.o_proj",
            "vision_model.model.layers.12.mlp.fc1",
            "vision_model.model.layers.12.mlp.fc2",
            "vision_model.model.layers.13.self_attn.q_proj",
            "vision_model.model.layers.13.self_attn.k_proj",
            "vision_model.model.layers.13.self_attn.v_proj",
            "vision_model.model.layers.13.self_attn.o_proj",
            "vision_model.model.layers.13.mlp.fc1",
            "vision_model.model.layers.13.mlp.fc2",
            "vision_model.model.layers.14.self_attn.q_proj",
            "vision_model.model.layers.14.self_attn.k_proj",
            "vision_model.model.layers.14.self_attn.v_proj",
            "vision_model.model.layers.14.self_attn.o_proj",
            "vision_model.model.layers.14.mlp.fc1",
            "vision_model.model.layers.14.mlp.fc2",
            "vision_model.model.layers.15.self_attn.q_proj",
            "vision_model.model.layers.15.self_attn.k_proj",
            "vision_model.model.layers.15.self_attn.v_proj",
            "vision_model.model.layers.15.self_attn.o_proj",
            "vision_model.model.layers.15.mlp.fc1",
            "vision_model.model.layers.15.mlp.fc2",
            "vision_model.model.layers.16.self_attn.q_proj",
            "vision_model.model.layers.16.self_attn.k_proj",
            "vision_model.model.layers.16.self_attn.v_proj",
            "vision_model.model.layers.16.self_attn.o_proj",
            "vision_model.model.layers.16.mlp.fc1",
            "vision_model.model.layers.16.mlp.fc2",
            "vision_model.model.layers.17.self_attn.q_proj",
            "vision_model.model.layers.17.self_attn.k_proj",
            "vision_model.model.layers.17.self_attn.v_proj",
            "vision_model.model.layers.17.self_attn.o_proj",
            "vision_model.model.layers.17.mlp.fc1",
            "vision_model.model.layers.17.mlp.fc2",
            "vision_model.model.layers.18.self_attn.q_proj",
            "vision_model.model.layers.18.self_attn.k_proj",
            "vision_model.model.layers.18.self_attn.v_proj",
            "vision_model.model.layers.18.self_attn.o_proj",
            "vision_model.model.layers.18.mlp.fc1",
            "vision_model.model.layers.18.mlp.fc2",
            "vision_model.model.layers.19.self_attn.q_proj",
            "vision_model.model.layers.19.self_attn.k_proj",
            "vision_model.model.layers.19.self_attn.v_proj",
            "vision_model.model.layers.19.self_attn.o_proj",
            "vision_model.model.layers.19.mlp.fc1",
            "vision_model.model.layers.19.mlp.fc2",
            "vision_model.model.layers.20.self_attn.q_proj",
            "vision_model.model.layers.20.self_attn.k_proj",
            "vision_model.model.layers.20.self_attn.v_proj",
            "vision_model.model.layers.20.self_attn.o_proj",
            "vision_model.model.layers.20.mlp.fc1",
            "vision_model.model.layers.20.mlp.fc2",
            "vision_model.model.layers.21.self_attn.q_proj",
            "vision_model.model.layers.21.self_attn.k_proj",
            "vision_model.model.layers.21.self_attn.v_proj",
            "vision_model.model.layers.21.self_attn.o_proj",
            "vision_model.model.layers.21.mlp.fc1",
            "vision_model.model.layers.21.mlp.fc2",
            "vision_model.model.layers.22.self_attn.q_proj",
            "vision_model.model.layers.22.self_attn.k_proj",
            "vision_model.model.layers.22.self_attn.v_proj",
            "vision_model.model.layers.22.self_attn.o_proj",
            "vision_model.model.layers.22.mlp.fc1",
            "vision_model.model.layers.22.mlp.fc2",
            "vision_model.model.layers.23.self_attn.q_proj",
            "vision_model.model.layers.23.self_attn.k_proj",
            "vision_model.model.layers.23.self_attn.v_proj",
            "vision_model.model.layers.23.self_attn.o_proj",
            "vision_model.model.layers.23.mlp.fc1",
            "vision_model.model.layers.23.mlp.fc2",
            "vision_model.model.layers.24.self_attn.q_proj",
            "vision_model.model.layers.24.self_attn.k_proj",
            "vision_model.model.layers.24.self_attn.v_proj",
            "vision_model.model.layers.24.self_attn.o_proj",
            "vision_model.model.layers.24.mlp.fc1",
            "vision_model.model.layers.24.mlp.fc2",
            "vision_model.model.layers.25.self_attn.q_proj",
            "vision_model.model.layers.25.self_attn.k_proj",
            "vision_model.model.layers.25.self_attn.v_proj",
            "vision_model.model.layers.25.self_attn.o_proj",
            "vision_model.model.layers.25.mlp.fc1",
            "vision_model.model.layers.25.mlp.fc2",
            "vision_model.model.layers.26.self_attn.q_proj",
            "vision_model.model.layers.26.self_attn.k_proj",
            "vision_model.model.layers.26.self_attn.v_proj",
            "vision_model.model.layers.26.self_attn.o_proj",
            "vision_model.model.layers.26.mlp.fc1",
            "vision_model.model.layers.26.mlp.fc2",
            "vision_model.model.layers.27.self_attn.q_proj",
            "vision_model.model.layers.27.self_attn.k_proj",
            "vision_model.model.layers.27.self_attn.v_proj",
            "vision_model.model.layers.27.self_attn.o_proj",
            "vision_model.model.layers.27.mlp.fc1",
            "vision_model.model.layers.27.mlp.fc2",
            "vision_model.model.layers.28.self_attn.q_proj",
            "vision_model.model.layers.28.self_attn.k_proj",
            "vision_model.model.layers.28.self_attn.v_proj",
            "vision_model.model.layers.28.self_attn.o_proj",
            "vision_model.model.layers.28.mlp.fc1",
            "vision_model.model.layers.28.mlp.fc2",
            "vision_model.model.layers.29.self_attn.q_proj",
            "vision_model.model.layers.29.self_attn.k_proj",
            "vision_model.model.layers.29.self_attn.v_proj",
            "vision_model.model.layers.29.self_attn.o_proj",
            "vision_model.model.layers.29.mlp.fc1",
            "vision_model.model.layers.29.mlp.fc2",
            "vision_model.model.layers.30.self_attn.q_proj",
            "vision_model.model.layers.30.self_attn.k_proj",
            "vision_model.model.layers.30.self_attn.v_proj",
            "vision_model.model.layers.30.self_attn.o_proj",
            "vision_model.model.layers.30.mlp.fc1",
            "vision_model.model.layers.30.mlp.fc2",
            "vision_model.model.layers.31.self_attn.q_proj",
            "vision_model.model.layers.31.self_attn.k_proj",
            "vision_model.model.layers.31.self_attn.v_proj",
            "vision_model.model.layers.31.self_attn.o_proj",
            "vision_model.model.layers.31.mlp.fc1",
            "vision_model.model.layers.31.mlp.fc2",
            "vision_model.model.layers.32.self_attn.q_proj",
            "vision_model.model.layers.32.self_attn.k_proj",
            "vision_model.model.layers.32.self_attn.v_proj",
            "vision_model.model.layers.32.self_attn.o_proj",
            "vision_model.model.layers.32.mlp.fc1",
            "vision_model.model.layers.32.mlp.fc2",
            "vision_model.model.layers.33.self_attn.q_proj",
            "vision_model.model.layers.33.self_attn.k_proj",
            "vision_model.model.layers.33.self_attn.v_proj",
            "vision_model.model.layers.33.self_attn.o_proj",
            "vision_model.model.layers.33.mlp.fc1",
            "vision_model.model.layers.33.mlp.fc2",
            "vision_model.vision_adapter.mlp.fc1",
            "vision_model.vision_adapter.mlp.fc2",
            "multi_modal_projector.linear_1",
            "language_model.model.layers.0.self_attn.q_proj",
            "language_model.model.layers.0.self_attn.k_proj",
            "language_model.model.layers.0.self_attn.v_proj",
            "language_model.model.layers.0.self_attn.o_proj",
            "language_model.model.layers.0.feed_forward.gate_proj",
            "language_model.model.layers.0.feed_forward.up_proj",
            "language_model.model.layers.0.feed_forward.down_proj",
            "language_model.model.layers.1.self_attn.q_proj",
            "language_model.model.layers.1.self_attn.k_proj",
            "language_model.model.layers.1.self_attn.v_proj",
            "language_model.model.layers.1.self_attn.o_proj",
            "language_model.model.layers.1.feed_forward.router",
            "language_model.model.layers.1.feed_forward.shared_expert.gate_proj",
            "language_model.model.layers.1.feed_forward.shared_expert.up_proj",
            "language_model.model.layers.1.feed_forward.shared_expert.down_proj",
            "language_model.model.layers.2.self_attn.q_proj",
            "language_model.model.layers.2.self_attn.k_proj",
            "language_model.model.layers.2.self_attn.v_proj",
            "language_model.model.layers.2.self_attn.o_proj",
            "language_model.model.layers.2.feed_forward.gate_proj",
            "language_model.model.layers.2.feed_forward.up_proj",
            "language_model.model.layers.2.feed_forward.down_proj",
            "language_model.model.layers.3.self_attn.q_proj",
            "language_model.model.layers.3.self_attn.k_proj",
            "language_model.model.layers.3.self_attn.v_proj",
            "language_model.model.layers.3.self_attn.o_proj",
            "language_model.model.layers.3.feed_forward.router",
            "language_model.model.layers.3.feed_forward.shared_expert.gate_proj",
            "language_model.model.layers.3.feed_forward.shared_expert.up_proj",
            "language_model.model.layers.3.feed_forward.shared_expert.down_proj",
            "language_model.model.layers.4.self_attn.q_proj",
            "language_model.model.layers.4.self_attn.k_proj",
            "language_model.model.layers.4.self_attn.v_proj",
            "language_model.model.layers.4.self_attn.o_proj",
            "language_model.model.layers.4.feed_forward.gate_proj",
            "language_model.model.layers.4.feed_forward.up_proj",
            "language_model.model.layers.4.feed_forward.down_proj",
            "language_model.model.layers.5.self_attn.q_proj",
            "language_model.model.layers.5.self_attn.k_proj",
            "language_model.model.layers.5.self_attn.v_proj",
            "language_model.model.layers.5.self_attn.o_proj",
            "language_model.model.layers.5.feed_forward.router",
            "language_model.model.layers.5.feed_forward.shared_expert.gate_proj",
            "language_model.model.layers.5.feed_forward.shared_expert.up_proj",
            "language_model.model.layers.5.feed_forward.shared_expert.down_proj",
            "language_model.model.layers.6.self_attn.q_proj",
            "language_model.model.layers.6.self_attn.k_proj",
            "language_model.model.layers.6.self_attn.v_proj",
            "language_model.model.layers.6.self_attn.o_proj",
            "language_model.model.layers.6.feed_forward.gate_proj",
            "language_model.model.layers.6.feed_forward.up_proj",
            "language_model.model.layers.6.feed_forward.down_proj",
            "language_model.model.layers.7.self_attn.q_proj",
            "language_model.model.layers.7.self_attn.k_proj",
            "language_model.model.layers.7.self_attn.v_proj",
            "language_model.model.layers.7.self_attn.o_proj",
            "language_model.model.layers.7.feed_forward.router",
            "language_model.model.layers.7.feed_forward.shared_expert.gate_proj",
            "language_model.model.layers.7.feed_forward.shared_expert.up_proj",
            "language_model.model.layers.7.feed_forward.shared_expert.down_proj",
            "language_model.model.layers.8.self_attn.q_proj",
            "language_model.model.layers.8.self_attn.k_proj",
            "language_model.model.layers.8.self_attn.v_proj",
            "language_model.model.layers.8.self_attn.o_proj",
            "language_model.model.layers.8.feed_forward.gate_proj",
            "language_model.model.layers.8.feed_forward.up_proj",
            "language_model.model.layers.8.feed_forward.down_proj",
            "language_model.model.layers.9.self_attn.q_proj",
            "language_model.model.layers.9.self_attn.k_proj",
            "language_model.model.layers.9.self_attn.v_proj",
            "language_model.model.layers.9.self_attn.o_proj",
            "language_model.model.layers.9.feed_forward.router",
            "language_model.model.layers.9.feed_forward.shared_expert.gate_proj",
            "language_model.model.layers.9.feed_forward.shared_expert.up_proj",
            "language_model.model.layers.9.feed_forward.shared_expert.down_proj",
            "language_model.model.layers.10.self_attn.q_proj",
            "language_model.model.layers.10.self_attn.k_proj",
            "language_model.model.layers.10.self_attn.v_proj",
            "language_model.model.layers.10.self_attn.o_proj",
            "language_model.model.layers.10.feed_forward.gate_proj",
            "language_model.model.layers.10.feed_forward.up_proj",
            "language_model.model.layers.10.feed_forward.down_proj",
            "language_model.model.layers.11.self_attn.q_proj",
            "language_model.model.layers.11.self_attn.k_proj",
            "language_model.model.layers.11.self_attn.v_proj",
            "language_model.model.layers.11.self_attn.o_proj",
            "language_model.model.layers.11.feed_forward.router",
            "language_model.model.layers.11.feed_forward.shared_expert.gate_proj",
            "language_model.model.layers.11.feed_forward.shared_expert.up_proj",
            "language_model.model.layers.11.feed_forward.shared_expert.down_proj",
            "language_model.model.layers.12.self_attn.q_proj",
            "language_model.model.layers.12.self_attn.k_proj",
            "language_model.model.layers.12.self_attn.v_proj",
            "language_model.model.layers.12.self_attn.o_proj",
            "language_model.model.layers.12.feed_forward.gate_proj",
            "language_model.model.layers.12.feed_forward.up_proj",
            "language_model.model.layers.12.feed_forward.down_proj",
            "language_model.model.layers.13.self_attn.q_proj",
            "language_model.model.layers.13.self_attn.k_proj",
            "language_model.model.layers.13.self_attn.v_proj",
            "language_model.model.layers.13.self_attn.o_proj",
            "language_model.model.layers.13.feed_forward.router",
            "language_model.model.layers.13.feed_forward.shared_expert.gate_proj",
            "language_model.model.layers.13.feed_forward.shared_expert.up_proj",
            "language_model.model.layers.13.feed_forward.shared_expert.down_proj",
            "language_model.model.layers.14.self_attn.q_proj",
            "language_model.model.layers.14.self_attn.k_proj",
            "language_model.model.layers.14.self_attn.v_proj",
            "language_model.model.layers.14.self_attn.o_proj",
            "language_model.model.layers.14.feed_forward.gate_proj",
            "language_model.model.layers.14.feed_forward.up_proj",
            "language_model.model.layers.14.feed_forward.down_proj",
            "language_model.model.layers.15.self_attn.q_proj",
            "language_model.model.layers.15.self_attn.k_proj",
            "language_model.model.layers.15.self_attn.v_proj",
            "language_model.model.layers.15.self_attn.o_proj",
            "language_model.model.layers.15.feed_forward.router",
            "language_model.model.layers.15.feed_forward.shared_expert.gate_proj",
            "language_model.model.layers.15.feed_forward.shared_expert.up_proj",
            "language_model.model.layers.15.feed_forward.shared_expert.down_proj",
            "language_model.model.layers.16.self_attn.q_proj",
            "language_model.model.layers.16.self_attn.k_proj",
            "language_model.model.layers.16.self_attn.v_proj",
            "language_model.model.layers.16.self_attn.o_proj",
            "language_model.model.layers.16.feed_forward.gate_proj",
            "language_model.model.layers.16.feed_forward.up_proj",
            "language_model.model.layers.16.feed_forward.down_proj",
            "language_model.model.layers.17.self_attn.q_proj",
            "language_model.model.layers.17.self_attn.k_proj",
            "language_model.model.layers.17.self_attn.v_proj",
            "language_model.model.layers.17.self_attn.o_proj",
            "language_model.model.layers.17.feed_forward.router",
            "language_model.model.layers.17.feed_forward.shared_expert.gate_proj",
            "language_model.model.layers.17.feed_forward.shared_expert.up_proj",
            "language_model.model.layers.17.feed_forward.shared_expert.down_proj",
            "language_model.model.layers.18.self_attn.q_proj",
            "language_model.model.layers.18.self_attn.k_proj",
            "language_model.model.layers.18.self_attn.v_proj",
            "language_model.model.layers.18.self_attn.o_proj",
            "language_model.model.layers.18.feed_forward.gate_proj",
            "language_model.model.layers.18.feed_forward.up_proj",
            "language_model.model.layers.18.feed_forward.down_proj",
            "language_model.model.layers.19.self_attn.q_proj",
            "language_model.model.layers.19.self_attn.k_proj",
            "language_model.model.layers.19.self_attn.v_proj",
            "language_model.model.layers.19.self_attn.o_proj",
            "language_model.model.layers.19.feed_forward.router",
            "language_model.model.layers.19.feed_forward.shared_expert.gate_proj",
            "language_model.model.layers.19.feed_forward.shared_expert.up_proj",
            "language_model.model.layers.19.feed_forward.shared_expert.down_proj",
            "language_model.model.layers.20.self_attn.q_proj",
            "language_model.model.layers.20.self_attn.k_proj",
            "language_model.model.layers.20.self_attn.v_proj",
            "language_model.model.layers.20.self_attn.o_proj",
            "language_model.model.layers.20.feed_forward.gate_proj",
            "language_model.model.layers.20.feed_forward.up_proj",
            "language_model.model.layers.20.feed_forward.down_proj",
            "language_model.model.layers.21.self_attn.q_proj",
            "language_model.model.layers.21.self_attn.k_proj",
            "language_model.model.layers.21.self_attn.v_proj",
            "language_model.model.layers.21.self_attn.o_proj",
            "language_model.model.layers.21.feed_forward.router",
            "language_model.model.layers.21.feed_forward.shared_expert.gate_proj",
            "language_model.model.layers.21.feed_forward.shared_expert.up_proj",
            "language_model.model.layers.21.feed_forward.shared_expert.down_proj",
            "language_model.model.layers.22.self_attn.q_proj",
            "language_model.model.layers.22.self_attn.k_proj",
            "language_model.model.layers.22.self_attn.v_proj",
            "language_model.model.layers.22.self_attn.o_proj",
            "language_model.model.layers.22.feed_forward.gate_proj",
            "language_model.model.layers.22.feed_forward.up_proj",
            "language_model.model.layers.22.feed_forward.down_proj",
            "language_model.model.layers.23.self_attn.q_proj",
            "language_model.model.layers.23.self_attn.k_proj",
            "language_model.model.layers.23.self_attn.v_proj",
            "language_model.model.layers.23.self_attn.o_proj",
            "language_model.model.layers.23.feed_forward.router",
            "language_model.model.layers.23.feed_forward.shared_expert.gate_proj",
            "language_model.model.layers.23.feed_forward.shared_expert.up_proj",
            "language_model.model.layers.23.feed_forward.shared_expert.down_proj",
            "language_model.model.layers.24.self_attn.q_proj",
            "language_model.model.layers.24.self_attn.k_proj",
            "language_model.model.layers.24.self_attn.v_proj",
            "language_model.model.layers.24.self_attn.o_proj",
            "language_model.model.layers.24.feed_forward.gate_proj",
            "language_model.model.layers.24.feed_forward.up_proj",
            "language_model.model.layers.24.feed_forward.down_proj",
            "language_model.model.layers.25.self_attn.q_proj",
            "language_model.model.layers.25.self_attn.k_proj",
            "language_model.model.layers.25.self_attn.v_proj",
            "language_model.model.layers.25.self_attn.o_proj",
            "language_model.model.layers.25.feed_forward.router",
            "language_model.model.layers.25.feed_forward.shared_expert.gate_proj",
            "language_model.model.layers.25.feed_forward.shared_expert.up_proj",
            "language_model.model.layers.25.feed_forward.shared_expert.down_proj",
            "language_model.model.layers.26.self_attn.q_proj",
            "language_model.model.layers.26.self_attn.k_proj",
            "language_model.model.layers.26.self_attn.v_proj",
            "language_model.model.layers.26.self_attn.o_proj",
            "language_model.model.layers.26.feed_forward.gate_proj",
            "language_model.model.layers.26.feed_forward.up_proj",
            "language_model.model.layers.26.feed_forward.down_proj",
            "language_model.model.layers.27.self_attn.q_proj",
            "language_model.model.layers.27.self_attn.k_proj",
            "language_model.model.layers.27.self_attn.v_proj",
            "language_model.model.layers.27.self_attn.o_proj",
            "language_model.model.layers.27.feed_forward.router",
            "language_model.model.layers.27.feed_forward.shared_expert.gate_proj",
            "language_model.model.layers.27.feed_forward.shared_expert.up_proj",
            "language_model.model.layers.27.feed_forward.shared_expert.down_proj",
            "language_model.model.layers.28.self_attn.q_proj",
            "language_model.model.layers.28.self_attn.k_proj",
            "language_model.model.layers.28.self_attn.v_proj",
            "language_model.model.layers.28.self_attn.o_proj",
            "language_model.model.layers.28.feed_forward.gate_proj",
            "language_model.model.layers.28.feed_forward.up_proj",
            "language_model.model.layers.28.feed_forward.down_proj",
            "language_model.model.layers.29.self_attn.q_proj",
            "language_model.model.layers.29.self_attn.k_proj",
            "language_model.model.layers.29.self_attn.v_proj",
            "language_model.model.layers.29.self_attn.o_proj",
            "language_model.model.layers.29.feed_forward.router",
            "language_model.model.layers.29.feed_forward.shared_expert.gate_proj",
            "language_model.model.layers.29.feed_forward.shared_expert.up_proj",
            "language_model.model.layers.29.feed_forward.shared_expert.down_proj",
            "language_model.model.layers.30.self_attn.q_proj",
            "language_model.model.layers.30.self_attn.k_proj",
            "language_model.model.layers.30.self_attn.v_proj",
            "language_model.model.layers.30.self_attn.o_proj",
            "language_model.model.layers.30.feed_forward.gate_proj",
            "language_model.model.layers.30.feed_forward.up_proj",
            "language_model.model.layers.30.feed_forward.down_proj",
            "language_model.model.layers.31.self_attn.q_proj",
            "language_model.model.layers.31.self_attn.k_proj",
            "language_model.model.layers.31.self_attn.v_proj",
            "language_model.model.layers.31.self_attn.o_proj",
            "language_model.model.layers.31.feed_forward.router",
            "language_model.model.layers.31.feed_forward.shared_expert.gate_proj",
            "language_model.model.layers.31.feed_forward.shared_expert.up_proj",
            "language_model.model.layers.31.feed_forward.shared_expert.down_proj",
            "language_model.model.layers.32.self_attn.q_proj",
            "language_model.model.layers.32.self_attn.k_proj",
            "language_model.model.layers.32.self_attn.v_proj",
            "language_model.model.layers.32.self_attn.o_proj",
            "language_model.model.layers.32.feed_forward.gate_proj",
            "language_model.model.layers.32.feed_forward.up_proj",
            "language_model.model.layers.32.feed_forward.down_proj",
            "language_model.model.layers.33.self_attn.q_proj",
            "language_model.model.layers.33.self_attn.k_proj",
            "language_model.model.layers.33.self_attn.v_proj",
            "language_model.model.layers.33.self_attn.o_proj",
            "language_model.model.layers.33.feed_forward.router",
            "language_model.model.layers.33.feed_forward.shared_expert.gate_proj",
            "language_model.model.layers.33.feed_forward.shared_expert.up_proj",
            "language_model.model.layers.33.feed_forward.shared_expert.down_proj",
            "language_model.model.layers.34.self_attn.q_proj",
            "language_model.model.layers.34.self_attn.k_proj",
            "language_model.model.layers.34.self_attn.v_proj",
            "language_model.model.layers.34.self_attn.o_proj",
            "language_model.model.layers.34.feed_forward.gate_proj",
            "language_model.model.layers.34.feed_forward.up_proj",
            "language_model.model.layers.34.feed_forward.down_proj",
            "language_model.model.layers.35.self_attn.q_proj",
            "language_model.model.layers.35.self_attn.k_proj",
            "language_model.model.layers.35.self_attn.v_proj",
            "language_model.model.layers.35.self_attn.o_proj",
            "language_model.model.layers.35.feed_forward.router",
            "language_model.model.layers.35.feed_forward.shared_expert.gate_proj",
            "language_model.model.layers.35.feed_forward.shared_expert.up_proj",
            "language_model.model.layers.35.feed_forward.shared_expert.down_proj",
            "language_model.model.layers.36.self_attn.q_proj",
            "language_model.model.layers.36.self_attn.k_proj",
            "language_model.model.layers.36.self_attn.v_proj",
            "language_model.model.layers.36.self_attn.o_proj",
            "language_model.model.layers.36.feed_forward.gate_proj",
            "language_model.model.layers.36.feed_forward.up_proj",
            "language_model.model.layers.36.feed_forward.down_proj",
            "language_model.model.layers.37.self_attn.q_proj",
            "language_model.model.layers.37.self_attn.k_proj",
            "language_model.model.layers.37.self_attn.v_proj",
            "language_model.model.layers.37.self_attn.o_proj",
            "language_model.model.layers.37.feed_forward.router",
            "language_model.model.layers.37.feed_forward.shared_expert.gate_proj",
            "language_model.model.layers.37.feed_forward.shared_expert.up_proj",
            "language_model.model.layers.37.feed_forward.shared_expert.down_proj",
            "language_model.model.layers.38.self_attn.q_proj",
            "language_model.model.layers.38.self_attn.k_proj",
            "language_model.model.layers.38.self_attn.v_proj",
            "language_model.model.layers.38.self_attn.o_proj",
            "language_model.model.layers.38.feed_forward.gate_proj",
            "language_model.model.layers.38.feed_forward.up_proj",
            "language_model.model.layers.38.feed_forward.down_proj",
            "language_model.model.layers.39.self_attn.q_proj",
            "language_model.model.layers.39.self_attn.k_proj",
            "language_model.model.layers.39.self_attn.v_proj",
            "language_model.model.layers.39.self_attn.o_proj",
            "language_model.model.layers.39.feed_forward.router",
            "language_model.model.layers.39.feed_forward.shared_expert.gate_proj",
            "language_model.model.layers.39.feed_forward.shared_expert.up_proj",
            "language_model.model.layers.39.feed_forward.shared_expert.down_proj",
            "language_model.model.layers.40.self_attn.q_proj",
            "language_model.model.layers.40.self_attn.k_proj",
            "language_model.model.layers.40.self_attn.v_proj",
            "language_model.model.layers.40.self_attn.o_proj",
            "language_model.model.layers.40.feed_forward.gate_proj",
            "language_model.model.layers.40.feed_forward.up_proj",
            "language_model.model.layers.40.feed_forward.down_proj",
            "language_model.model.layers.41.self_attn.q_proj",
            "language_model.model.layers.41.self_attn.k_proj",
            "language_model.model.layers.41.self_attn.v_proj",
            "language_model.model.layers.41.self_attn.o_proj",
            "language_model.model.layers.41.feed_forward.router",
            "language_model.model.layers.41.feed_forward.shared_expert.gate_proj",
            "language_model.model.layers.41.feed_forward.shared_expert.up_proj",
            "language_model.model.layers.41.feed_forward.shared_expert.down_proj",
            "language_model.model.layers.42.self_attn.q_proj",
            "language_model.model.layers.42.self_attn.k_proj",
            "language_model.model.layers.42.self_attn.v_proj",
            "language_model.model.layers.42.self_attn.o_proj",
            "language_model.model.layers.42.feed_forward.gate_proj",
            "language_model.model.layers.42.feed_forward.up_proj",
            "language_model.model.layers.42.feed_forward.down_proj",
            "language_model.model.layers.43.self_attn.q_proj",
            "language_model.model.layers.43.self_attn.k_proj",
            "language_model.model.layers.43.self_attn.v_proj",
            "language_model.model.layers.43.self_attn.o_proj",
            "language_model.model.layers.43.feed_forward.router",
            "language_model.model.layers.43.feed_forward.shared_expert.gate_proj",
            "language_model.model.layers.43.feed_forward.shared_expert.up_proj",
            "language_model.model.layers.43.feed_forward.shared_expert.down_proj",
            "language_model.model.layers.44.self_attn.q_proj",
            "language_model.model.layers.44.self_attn.k_proj",
            "language_model.model.layers.44.self_attn.v_proj",
            "language_model.model.layers.44.self_attn.o_proj",
            "language_model.model.layers.44.feed_forward.gate_proj",
            "language_model.model.layers.44.feed_forward.up_proj",
            "language_model.model.layers.44.feed_forward.down_proj",
            "language_model.model.layers.45.self_attn.q_proj",
            "language_model.model.layers.45.self_attn.k_proj",
            "language_model.model.layers.45.self_attn.v_proj",
            "language_model.model.layers.45.self_attn.o_proj",
            "language_model.model.layers.45.feed_forward.router",
            "language_model.model.layers.45.feed_forward.shared_expert.gate_proj",
            "language_model.model.layers.45.feed_forward.shared_expert.up_proj",
            "language_model.model.layers.45.feed_forward.shared_expert.down_proj",
            "language_model.model.layers.46.self_attn.q_proj",
            "language_model.model.layers.46.self_attn.k_proj",
            "language_model.model.layers.46.self_attn.v_proj",
            "language_model.model.layers.46.self_attn.o_proj",
            "language_model.model.layers.46.feed_forward.gate_proj",
            "language_model.model.layers.46.feed_forward.up_proj",
            "language_model.model.layers.46.feed_forward.down_proj",
            "language_model.model.layers.47.self_attn.q_proj",
            "language_model.model.layers.47.self_attn.k_proj",
            "language_model.model.layers.47.self_attn.v_proj",
            "language_model.model.layers.47.self_attn.o_proj",
            "language_model.model.layers.47.feed_forward.router",
            "language_model.model.layers.47.feed_forward.shared_expert.gate_proj",
            "language_model.model.layers.47.feed_forward.shared_expert.up_proj",
            "language_model.model.layers.47.feed_forward.shared_expert.down_proj",
            "language_model.lm_head"
        ],
        "kv_cache_scheme": null,
        "quant_method": "compressed-tensors",
        "quantization_status": "compressed"
    },
    "_attn_implementation_autoset": true,
    "attention_bias": false,
    "attention_chunk_size": 8192,
    "attention_dropout": 0.0,
    "bos_token_id": 200000,
    "eos_token_id": [
        200001,
        200007,
        200008
    ],
    "for_llm_compressor": true,
    "head_dim": 128,
    "hidden_act": "silu",
    "hidden_size": 5120,
    "initializer_range": 0.02,
    "interleave_moe_layer_step": 2,
    "intermediate_size": 8192,
    "intermediate_size_mlp": 16384,
    "max_position_embeddings": 1048576,

    "nope_layer_interval": 4,
    "num_attention_heads": 40,
    "num_experts_per_tok": 1,
    "num_hidden_layers": 48,
    "num_key_value_heads": 8,
    "num_local_experts": 128,
    "output_router_logits": false,
    "pad_token_id": 200018,
    "rms_norm_eps": 1e-05,
    "rope_scaling": null,
    "rope_theta": 500000.0,
    "router_aux_loss_coef": 0.001,
    "router_jitter_noise": 0.0,

    "use_cache": true,
    "use_qk_norm": false,
    "vocab_size": 202048,
    "text_config": {
        "_attn_implementation_autoset": true,
        "attention_bias": false,
        "attention_chunk_size": 8192,
        "attention_dropout": 0.0,
        "bos_token_id": 200000,
        "eos_token_id": [
            200001,
            200007,
            200008
        ],
        "for_llm_compressor": true,
        "head_dim": 128,
        "hidden_act": "silu",
        "hidden_size": 5120,
        "initializer_range": 0.02,
        "interleave_moe_layer_step": 2,
        "intermediate_size": 8192,
        "intermediate_size_mlp": 16384,
        "max_position_embeddings": 1048576,
        "model_type": "llama4_text",
        "nope_layer_interval": 4,
        "num_attention_heads": 40,
        "num_experts_per_tok": 1,
        "num_hidden_layers": 48,
        "num_key_value_heads": 8,
        "num_local_experts": 128,
        "output_router_logits": false,
        "pad_token_id": 200018,
        "rms_norm_eps": 1e-05,
        "rope_scaling": null,
        "rope_theta": 500000.0,
        "router_aux_loss_coef": 0.001,
        "router_jitter_noise": 0.0,
        "torch_dtype": "bfloat16",
        "use_cache": true,
        "use_qk_norm": false,
        "vocab_size": 202048
    },
    "torch_dtype": "bfloat16",
    "transformers_version": "4.51.0.dev0",
    "vision_config": {
        "_attn_implementation_autoset": true,
        "attention_dropout": 0.0,
        "hidden_act": "gelu",
        "hidden_size": 1408,
        "image_size": 336,
        "initializer_range": 0.02,
        "intermediate_size": 5632,
        "model_type": "llama4_vision_model",
        "multi_modal_projector_bias": false,
        "norm_eps": 1e-05,
        "num_attention_heads": 16,
        "num_channels": 3,
        "num_hidden_layers": 34,
        "patch_size": 14,
        "pixel_shuffle_ratio": 0.5,
        "projector_dropout": 0.0,
        "projector_input_dim": 4096,
        "projector_output_dim": 4096,
        "rope_theta": 10000,
        "vision_feature_layer": -1,
        "vision_feature_select_strategy": "default",
        "vision_output_dim": 4096
    }
}
